duxinglang-1/nRF9160_test/E2_V3_IMU_TEST/src/imu/lsm6dso.c
	lsm6dso_fifo_mode_set(&imu_dev_ctx, LSM6DSO_STREAM_TO_FIFO_MODE);

	lsm6dso_xl_data_rate_set(&imu_dev_ctx, LSM6DSO_XL_ODR_52Hz);
	lsm6dso_gy_data_rate_set(&imu_dev_ctx, LSM6DSO_GY_ODR_OFF);

	lsm6dso_tap_detection_on_z_set(&imu_dev_ctx, PROPERTY_ENABLE);
	lsm6dso_tap_detection_on_y_set(&imu_dev_ctx, PROPERTY_ENABLE);
	lsm6dso_tap_detection_on_x_set(&imu_dev_ctx, PROPERTY_ENABLE);

	lsm6dso_tap_threshold_x_set(&imu_dev_ctx, 0x12);
	lsm6dso_tap_threshold_y_set(&imu_dev_ctx, 0x12);
	lsm6dso_tap_threshold_z_set(&imu_dev_ctx, 0x12);

	lsm6dso_tap_quiet_set(&imu_dev_ctx, 0x03);
	lsm6dso_tap_shock_set(&imu_dev_ctx, 0x03);

	lsm6dso_tap_mode_set(&imu_dev_ctx, LSM6DSO_ONLY_SINGLE);

	//lsm6dso_all_sources_get(&imu_dev_ctx, &all_source);

	// ULTRA LOW POWER & INACTIVITY MODE
	//lsm6dso_xl_power_mode_set(&imu_dev_ctx, LSM6DSO_ULTRA_LOW_POWER_MD);
	/* Set duration for Activity detection to 38 ms (= 1 * 1 / ODR_XL) */
	//lsm6dso_wkup_dur_set(&imu_dev_ctx, 0x01);
	/* Set duration for Inactivity detection to 19.69 s (= 1 * 512 / ODR_XL) */
	//lsm6dso_act_sleep_dur_set(&imu_dev_ctx, 0x01);
	/* Set Activity/Inactivity threshold to 312.5 mg */
	//lsm6dso_wkup_threshold_set(&imu_dev_ctx, 0x05);
	/* Inactivity configuration: XL to 12.5 in LP, gyro to Power-Down */
	//lsm6dso_act_mode_set(&imu_dev_ctx, LSM6DSO_XL_12Hz5_GY_PD);
	/* Enable interrupt generation on Inactivity INT1 pin */
	//lsm6dso_pin_int1_route_get(&imu_dev_ctx, &int1_route);
	//int1_route.md1_cfg.int1_sleep_change = PROPERTY_ENABLE; 
	//lsm6dso_pin_int1_route_set(&imu_dev_ctx, &int1_route);

	lsm6dso_int_notification_set(&imu_dev_ctx, LSM6DSO_BASE_PULSED_EMB_LATCHED);

	/*Step Counter enable*/
	//lsm6dso_pin_int1_route_get(&imu_dev_ctx, &int1_route);
	//int1_route.emb_func_int1.int1_step_detector = PROPERTY_ENABLE;
	//lsm6dso_pin_int1_route_set(&imu_dev_ctx, &int1_route);
	/* Enable False Positive Rejection. */
	//lsm6dso_pedo_sens_set(&imu_dev_ctx, LSM6DSO_FALSE_STEP_REJ); 
	//lsm6dso_steps_reset(&imu_dev_ctx);

	/* Tilt enable */
	lsm6dso_long_cnt_int_value_set(&imu_dev_ctx, 0x0000U);
	lsm6dso_fsm_start_address_set(&imu_dev_ctx, LSM6DSO_START_FSM_ADD);
	lsm6dso_fsm_number_of_programs_set(&imu_dev_ctx, 2);
	lsm6dso_fsm_enable_get(&imu_dev_ctx, &fsm_enable);
	fsm_enable.fsm_enable_a.fsm1_en = PROPERTY_ENABLE;
	fsm_enable.fsm_enable_a.fsm2_en = PROPERTY_ENABLE;
	lsm6dso_fsm_enable_set(&imu_dev_ctx, &fsm_enable);  
	lsm6dso_fsm_data_rate_set(&imu_dev_ctx, LSM6DSO_ODR_FSM_26Hz);
	fsm_addr = LSM6DSO_START_FSM_ADD;
	lsm6dso_ln_pg_write(&imu_dev_ctx, fsm_addr, (uint8_t*)lsm6so_prg_wrist_tilt, sizeof(lsm6so_prg_wrist_tilt));
	fsm_addr += sizeof(lsm6so_prg_wrist_tilt);
	//lsm6dso_ln_pg_write(&imu_dev_ctx, fsm_addr, (uint8_t*)falltrigger, sizeof(falltrigger));

	/* wrist single tap, wrist tilt to INT2 pin*/
	lsm6dso_pin_int2_route_get(&imu_dev_ctx, &int2_route);
	//int2_route.fsm_int2_a.int2_fsm1 = PROPERTY_ENABLE;
	//int2_route.fsm_int2_a.int2_fsm2 = PROPERTY_ENABLE;
	int2_route.md2_cfg.int2_single_tap = PROPERTY_ENABLE;
	lsm6dso_pin_int2_route_set(&imu_dev_ctx, &int2_route);

	/* route step counter to INT1 pin*/
	lsm6dso_pin_int1_route_get(&imu_dev_ctx, &int1_route);
	//int1_route.emb_func_int1.int1_step_detector = PROPERTY_ENABLE;
	int1_route.fsm_int1_a.int1_fsm1 = PROPERTY_ENABLE;
	lsm6dso_pin_int1_route_set(&imu_dev_ctx, &int1_route);

	lsm6dso_timestamp_set(&imu_dev_ctx, 1);

	return true;
}

void sensor_reset(void)
{
	lsm6dso_reset_set(&imu_dev_ctx, PROPERTY_ENABLE);
	lsm6dso_reset_get(&imu_dev_ctx, &rst);
	lsm6dso_i3c_disable_set(&imu_dev_ctx, LSM6DSO_I3C_DISABLE);
	lsm6dso_fifo_watermark_set(&imu_dev_ctx, ACC_GYRO_FIFO_BUF_LEN);
	lsm6dso_fifo_stop_on_wtm_set(&imu_dev_ctx, PROPERTY_ENABLE);
	lsm6dso_fifo_mode_set(&imu_dev_ctx, LSM6DSO_STREAM_MODE);
	lsm6dso_data_ready_mode_set(&imu_dev_ctx, LSM6DSO_DRDY_PULSED);
	lsm6dso_fifo_xl_batch_set(&imu_dev_ctx, LSM6DSO_XL_BATCHED_AT_52Hz);
	lsm6dso_fifo_gy_batch_set(&imu_dev_ctx, LSM6DSO_GY_BATCHED_AT_52Hz);
	lsm6dso_xl_full_scale_set(&imu_dev_ctx, LSM6DSO_4g);
	lsm6dso_gy_full_scale_set(&imu_dev_ctx, LSM6DSO_250dps);
	lsm6dso_block_data_update_set(&imu_dev_ctx, PROPERTY_ENABLE);
	lsm6dso_xl_data_rate_set(&imu_dev_ctx, LSM6DSO_XL_ODR_52Hz);
	lsm6dso_gy_data_rate_set(&imu_dev_ctx, LSM6DSO_GY_ODR_52Hz);
}

/*@brief Get real time X/Y/Z reading in mg
*
*/
void get_sensor_reading(float *sensor_x, float *sensor_y, float *sensor_z)
{
	uint8_t reg;

	lsm6dso_xl_flag_data_ready_get(&imu_dev_ctx, &reg);
	if(reg)
	{
		memset(data_raw_acceleration.u8bit, 0x00, 3*sizeof(int16_t));
		lsm6dso_acceleration_raw_get(&imu_dev_ctx, data_raw_acceleration.u8bit);
		acceleration_mg[0] = lsm6dso_from_fs2_to_mg(data_raw_acceleration.i16bit[0]);
		acceleration_mg[1] = lsm6dso_from_fs2_to_mg(data_raw_acceleration.i16bit[1]);
		acceleration_mg[2] = lsm6dso_from_fs2_to_mg(data_raw_acceleration.i16bit[2]);
	}

	*sensor_x = acceleration_mg[0];
	*sensor_y = acceleration_mg[1];
	*sensor_z = acceleration_mg[2];
}

void is_tilt(void)
{
	lsm6dso_all_sources_t status;
	lsm6dso_all_sources_get(&imu_dev_ctx, &status);
	if(status.fsm_status_a.is_fsm1)
	{ 
		wrist_tilt = true;
	}
}

void activity_process(void)
{
	uint16_t num = 0;
	uint8_t waterm = 0;
	lsm6dso_fifo_tag_t reg_tag;
	axis3bit16_t dummy;

	lsm6dso_fifo_wtm_flag_get(&imu_dev_ctx, &waterm);
	if(waterm>0)
	{
		lsm6dso_fifo_data_level_get(&imu_dev_ctx, &num);
		while(num--)
		{
			lsm6dso_fifo_sensor_tag_get(&imu_dev_ctx, &reg_tag);
			switch(reg_tag)
			{
			case LSM6DSO_XL_NC_TAG:
				memset(data_raw_acceleration.u8bit, 0x00, 3*sizeof(int16_t));
				lsm6dso_fifo_out_raw_get(&imu_dev_ctx, data_raw_acceleration.u8bit);
				acceleration_mg[0] = lsm6dso_from_fs2_to_mg(data_raw_acceleration.i16bit[0]);
				acceleration_mg[1] = lsm6dso_from_fs2_to_mg(data_raw_acceleration.i16bit[1]);
				acceleration_mg[2] = lsm6dso_from_fs2_to_mg(data_raw_acceleration.i16bit[2]);

				acceleration_g[0]   = acceleration_mg[0]/1000;
				acceleration_g[1]   = acceleration_mg[1]/1000;
				acceleration_g[2]   = acceleration_mg[2]/1000;

				//LOGD("Axyz, %4.2f, %4.2f, %4.2f", acceleration_g[0], acceleration_g[1], acceleration_g[2]);
				break;

			case LSM6DSO_GYRO_NC_TAG:
				memset(data_raw_angular_rate.u8bit, 0x00, 3*sizeof(int16_t));
				lsm6dso_fifo_out_raw_get(&imu_dev_ctx, data_raw_angular_rate.u8bit);
				angular_rate_mdps[0] = lsm6dso_from_fs250_to_mdps(data_raw_angular_rate.i16bit[0]);
				angular_rate_mdps[1] = lsm6dso_from_fs250_to_mdps(data_raw_angular_rate.i16bit[1]);
				angular_rate_mdps[2] = lsm6dso_from_fs250_to_mdps(data_raw_angular_rate.i16bit[2]);

				angular_rate_dps[0] = angular_rate_mdps[0]/1000;
				angular_rate_dps[1] = angular_rate_mdps[1]/1000;
				angular_rate_dps[2] = angular_rate_mdps[2]/1000;

				//LOGD("%d, Gxyz, %4.2f, %4.2f, %4.2f", i, angular_rate_dps[0], angular_rate_dps[1], angular_rate_dps[2]);
				break;

			default:
				memset(dummy.u8bit, 0x00, 3 * sizeof(int16_t));
				lsm6dso_fifo_out_raw_get(&imu_dev_ctx, dummy.u8bit);
				break;
			}

			runActivityAlgorithms(acceleration_g[0], acceleration_g[0], acceleration_g[0]);         
		}
	}
}

