duxinglang-1/nRF9160_test/E2_V3_IMU_TEST/src/imu/lsm6dso.c
	//===================================================1-Fuzzification
	low_angle_degree =    get_input_degree(current_angle, MEDIUM_ANGLE, 0, LOW_ANGLE, MEDIUM_ANGLE);
	medium_angle_degree = get_input_degree(current_angle, LOW_ANGLE, MEDIUM_ANGLE, HIGH_ANGLE, HIGH_ANGLE);
	high_angle_degree =   get_input_degree(current_angle, MEDIUM_ANGLE, HIGH_ANGLE, 0, HIGH_ANGLE);

	low_gyro_magnitude_degree =    get_input_degree(current_max_gyro_magn, MEDIUM_GYRO_MAGNITUDE, 0, LOW_GYRO_MAGNITUDE, MEDIUM_GYRO_MAGNITUDE);
	medium_gyro_magnitude_degree = get_input_degree(current_max_gyro_magn, LOW_GYRO_MAGNITUDE, MEDIUM_GYRO_MAGNITUDE, HIGH_GYRO_MAGNITUDE, HIGH_GYRO_MAGNITUDE);
	high_gyro_magnitude_degree =   get_input_degree(current_max_gyro_magn, MEDIUM_GYRO_MAGNITUDE, HIGH_GYRO_MAGNITUDE, 0, HIGH_GYRO_MAGNITUDE);

	//===================================================2-Fire Strength
	fire_strength[0] = min(low_angle_degree   , low_gyro_magnitude_degree);
	fire_strength[1] = min(low_angle_degree   , medium_gyro_magnitude_degree);
	fire_strength[2] = min(low_angle_degree   , high_gyro_magnitude_degree);
	fire_strength[3] = min(medium_angle_degree, low_gyro_magnitude_degree);
	fire_strength[4] = min(medium_angle_degree, medium_gyro_magnitude_degree);
	fire_strength[5] = min(medium_angle_degree, high_gyro_magnitude_degree);
	fire_strength[6] = min(high_angle_degree  , low_gyro_magnitude_degree);
	fire_strength[7] = min(high_angle_degree  , medium_gyro_magnitude_degree);
	fire_strength[8] = min(high_angle_degree  , high_gyro_magnitude_degree);

	//======================================================3- linguistic and numric output
	for (i = 0; i < 9; i++)
	{
		output_value += fire_strength[i] * get_output_from_memship(suspicion_rules[i][2]);
		sum_firestrenths += fire_strength[i];
	}
	output_value /= sum_firestrenths;
	return output_value;
}

/*@brief Fall detection analyse
*
* @return If fall return 1, otherwise return 0
*/
void fall_detection(void)
{
	historic_buffer();
#ifdef IMU_DEBUG
	LOGD("Historic buffer filled");
#endif

	if(hist_buff_flag)
	{
		curr_vrif_buffers();
		hist_buff_flag = false;
	#ifdef IMU_DEBUG
		LOGD("Current verification buffer filled");
	#endif
	}

	if(curr_vrif_buff_flag)
	{       
		acc_magn_square = acceleration_analyse_fifo();
		cur_angle = angle_analyse_fifo();
		cur_max_gyro_magn = gyroscope_analyse_fifo();
		cur_fuzzy_output = fuzzy_analyse(cur_angle, cur_max_gyro_magn);
		std_devi = fall_verification_fifo_skip();

		if(cur_fuzzy_output > FUZZY_OUT_THRES_DEF)
		{
			if(std_devi < STD_VARIANCE_THRES_DEF)
			{
				fall_result = true;
			#ifdef IMU_DEBUG
				LOGD("Fall detected, fuzzy output and standard deviation satisfied");
			#endif
				//break;
			}
			else
			{
				fall_result = false; //std not satisfied
			#ifdef IMU_DEBUG
				LOGD("Fall not detected, standard deviation not satisfied");
			#endif
			}
		}
		else
		{
			fall_result = false; //fuzzy output not satisfied
		#ifdef IMU_DEBUG
			LOGD("Fall not detected, fuzzy output not satisfied");
		#endif
		}

		curr_vrif_buff_flag = false;
		sensor_init(); //resets the algorithm, will work continuosly on every tap
	#ifdef IMU_DEBUG
		LOGD("Set sensor back to default settings");
	#endif
	}

	if(fall_result)
	{            
		fall_result = false;
		FallTrigger();
	}
	else
	{
	#ifdef IMU_DEBUG
		LOGD("Not Fall.");
	#endif
	}

	fall_check_flag = false;
}

static void fall_check(struct k_work *work)
{
	fall_detection();
}
#endif

void ReSetImuSteps(void)
{
	//lsm6dso_steps_reset(&imu_dev_ctx);
        MotionPW_ResetStepCount();

	g_last_steps = 0;
	g_steps = 0;
	g_distance = 0;
	g_calorie = 0;
	
	last_sport.timestamp.year = date_time.year;
	last_sport.timestamp.month = date_time.month; 
	last_sport.timestamp.day = date_time.day;
	last_sport.timestamp.hour = date_time.hour;
	last_sport.timestamp.minute = date_time.minute;
	last_sport.timestamp.second = date_time.second;
	last_sport.timestamp.week = date_time.week;
	last_sport.steps = g_steps;
	last_sport.distance = g_distance;
	last_sport.calorie = g_calorie;
	save_cur_sport_to_record(&last_sport);	
}

void GetImuSteps(uint16_t *steps)
{
	*steps = MPW_data_out.Nsteps;
}

void UpdateIMUData(void)
{
	//uint16_t steps;
	
	//GetImuSteps(&steps);

	//g_steps = steps+g_last_steps;
        g_steps = MPW_data_out.Nsteps + g_last_steps;
	g_distance = 0.7*g_steps;
	g_calorie = (0.8214*60*g_distance)/1000;

#ifdef IMU_DEBUG
	LOGD("g_steps:%d,g_distance:%d,g_calorie:%d", g_steps, g_distance, g_calorie);
#endif

	last_sport.timestamp.year = date_time.year;
	last_sport.timestamp.month = date_time.month; 
	last_sport.timestamp.day = date_time.day;
	last_sport.timestamp.hour = date_time.hour;
	last_sport.timestamp.minute = date_time.minute;
	last_sport.timestamp.second = date_time.second;
	last_sport.timestamp.week = date_time.week;
	last_sport.steps = g_steps;
	last_sport.distance = g_distance;
	last_sport.calorie = g_calorie;
	save_cur_sport_to_record(&last_sport);
	
	//StepCheckSendLocationData(g_steps);
	SetCurDayStepRecData(g_steps);
}

void GetSportData(uint16_t *steps, uint16_t *calorie, uint16_t *distance)
{
	if(steps != NULL)
		*steps = g_steps;
	if(calorie != NULL)
		*calorie = g_calorie;
	if(distance != NULL)
		*distance = g_distance;
}

/*@Set Sensor sensitivity
*/
/*void lsm6dso_sensitivity(void)
{
	//Set the debounce steps
	uint8_t deb_step = 15;
	lsm6dso_pedo_debounce_steps_set(&imu_dev_ctx, &deb_step);

	//Set the sensitivity of the sensor
	uint8_t delay_time[2] = {0x00U, 0x32U};
	//Lower Limit is 0 and Upper Limit is 50(32 in Hex), the delay time is 320ms
	lsm6dso_pedo_steps_period_set(&imu_dev_ctx, &delay_time);
}*/

uint8_t IMU_GetID(void)
{
	uint8_t sensor_id = 0;
	
	lsm6dso_device_id_get(&imu_dev_ctx, &sensor_id);
	return sensor_id;
}

void IMU_init(struct k_work_q *work_q)
{
#ifdef IMU_DEBUG
	LOGD("IMU_init");
#endif

	get_cur_sport_from_record(&last_sport);
#ifdef IMU_DEBUG
	LOGD("%04d/%02d/%02d last_steps:%d", last_sport.timestamp.year,last_sport.timestamp.month,last_sport.timestamp.day,last_sport.steps);
#endif
	if(last_sport.timestamp.day == date_time.day)
	{
		g_last_steps = last_sport.steps;
		g_steps = last_sport.steps;
		g_distance = last_sport.distance;
		g_calorie = last_sport.calorie;
	}

	if(init_i2c() != 0)
		return;
	
	init_gpio();

	imu_dev_ctx.write_reg = platform_write;
	imu_dev_ctx.read_reg = platform_read;
	imu_dev_ctx.handle = i2c_imu;

	imu_check_ok = sensor_init();
	if(!imu_check_ok)
		return;

    initActivityLib();
	getActivityLibVer();

#ifdef CONFIG_STEP_SUPPORT
	//lsm6dso_steps_reset(&imu_dev_ctx); //reset step counter
	//lsm6dso_sensitivity();
	initStepLib();
	getStepLibVer();
#endif
#ifdef CONFIG_SLEEP_SUPPORT
	initSleepLib();
	getSleepLibVer();
	//StartSleepTimeMonitor();
#endif
#ifdef IMU_DEBUG
	LOGD("IMU_init done!");
#endif

	imu_work_q = work_q;

